app/controllers/flights_controller.rb

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("flight_number", "origin", "destination", "departure_date", "airplane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE "flights" SET "airplane_name" = $1, "updated_at" = $2 WHERE "flights"."id" = $3  [["airplane_name", "1"], ["updated_at", "2019-08-14 01:32:52.612545"], ["id", 1]]