app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "isadmin", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["email", ""], ["isadmin", false], ["password", ""], ["created_at", "2019-08-14 04:08:48.427487"], ["updated_at", "2019-08-14 04:08:48.427487"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save